import photo1 from "../assets/photo-1.jpeg";
import photo2 from "../assets/photo-2.jpeg";
import photo3 from "../assets/photo-3.jpeg";
import photo4 from "../assets/photo-4.jpeg";
import photo5 from "../assets/photo-5.jpeg";
import photo6 from "../assets/photo-6.jpeg";
import photo7 from "../assets/photo-7.jpeg";
import photo8 from "../assets/photo-8.jpeg";
import photo9 from "../assets/photo-9.jpeg";
import photo10 from "../assets/photo-10.jpeg";
import photo11 from "../assets/photo-11.jpeg";
import photo12 from "../assets/photo-12.jpeg";

import { BirthdayItem } from "../types";

const birthdayItems: BirthdayItem[] = [
  {
    label: "Даря",
    x: "10%",
    y: "5%",
    image: photo1,
    title: "TikTok непокорим?",
    description:
      "Даря так точно не считает. Еще пару месяцев и ваши рекомендации будут заполнены её работами.",
  },
  {
    label: "Даня",
    x: "80%",
    y: "27%",
    image: photo2,
    title: "Ни дня без капуччино",
    description:
      "Утро началось не с кофе? Даня превращается в соню на целый день.",
  },
  {
    label: "Даша",
    x: "50%",
    y: "15%",
    image: photo3,
    title: "Сноуборд ❤️",
    description:
      "Даша безумно быстро достигла высокого уровня катания. При этом она всё также может отвлечься на белку и упасть.",
  },
  {
    label: "Дигидондашка",
    x: "10%",
    y: "23%",
    image: photo4,
    title: "Глазки-раскраски",
    description:
      "Именно такими глазами Дигидондашка смотрит на свежеприготовленный хот-дог из Nathans.",
  },
  {
    label: "Дашуня",
    x: "30%",
    y: "35%",
    image: photo5,
    title: "Хобби и увлечения",
    description:
      "Дашуня одинаково обожает две вещи: животных и сон. Максимальное удоволсьтвие достигается, когда сон сопровождается животным на спине.",
  },
  {
    label: "Дарёна",
    x: "70%",
    y: "3%",
    image: photo6,
    title: "Команда УДАЧА",
    description:
      "Быть настолько же удачливыми как мы с Дарёной - невозможно. Только мы приезжаем в Париж во время митингов и ходим по 20 км до всех достопремичательностей.",
  },
  {
    label: "Дарька",
    x: "8%",
    y: "60%",
    image: photo7,
    title: "Невозможное - возможно!",
    description:
      "Вес в 44кг не мешает Дарьке съедать бургеры размером с голову.",
  },
  {
    label: "Дарей",
    x: "80%",
    y: "55%",
    image: photo8,
    title: "Клоун, Камикадзе, что еще?",
    description:
      "Дарей обожает аттракционы после которых у болшинства людей голова идёт кругом.",
  },
  {
    label: "Дарюшка",
    x: "70%",
    y: "70%",
    image: photo9,
    title: "Эффектный лук",
    description:
      "Дарюшка любит надевать вещи, в которых она неотразима. В то же время, ей кажется, что эти вещи слишком открытые и она их постоянно поправляет.",
  },
  {
    label: "Дашка-Чебурашка",
    x: "25%",
    y: "75%",
    image: photo10,
    title: "Ребенок навсегда",
    description:
      "Дашка-Чебурашка обожает пузыри. Чем больше пузырь, тем шире улыбка.",
  },
  {
    label: "Доря",
    x: "10%",
    y: "87%",
    image: photo11,
    title: "Нужна идея для фотосета?",
    description:
      "Пишите Доре в Direct, она спродюсирует вам великолепную съемку.",
  },
  {
    label: "Дарюша",
    x: "55%",
    y: "90%",
    image: photo12,
    title: "Люблю тебя",
    description:
      "С Днём рождения, Дарюша! Расти большой, всегда с тобой. ✊😘",
  },
];

export default birthdayItems;
