import photo1 from "../assets/photo-1.jpeg";
import { BirthdayItem } from "../types";

const birthdayItems: BirthdayItem[] = [
  {
    label: "Даря",
    x: "10%",
    y: "5%",
    image: photo1,
    title: "TikTok непокорим?",
    description:
      "Даря так точно не считает. Еще пару месяцев и ваши рекомендации будут заполнены её работами.",
  },
  {
    label: "Даша",
    x: "50%",
    y: "15%",
    image: photo1,
    title: "TikTok непокорим?",
    description:
      "Даря так точно не считает. Еще пару месяцев и ваши рекомендации будут заполнены её работами.",
  },
  {
    label: "Даня",
    x: "80%",
    y: "27%",
    image: photo1,
    title: "TikTok непокорим?",
    description:
      "Даря так точно не считает. Еще пару месяцев и ваши рекомендации будут заполнены её работами.",
  },
  {
    label: "Дигидондашка",
    x: "10%",
    y: "23%",
    image: photo1,
    title: "TikTok непокорим?",
    description:
      "Даря так точно не считает. Еще пару месяцев и ваши рекомендации будут заполнены её работами.",
  },
  {
    label: "Дашуня",
    x: "30%",
    y: "35%",
    image: photo1,
    title: "TikTok непокорим?",
    description:
      "Даря так точно не считает. Еще пару месяцев и ваши рекомендации будут заполнены её работами.",
  },
  {
    label: "Дадада это кавказ",
    x: "70%",
    y: "3%",
    image: photo1,
    title: "TikTok непокорим?",
    description:
      "Даря так точно не считает. Еще пару месяцев и ваши рекомендации будут заполнены её работами.",
  },
  {
    label: "Дарька",
    x: "8%",
    y: "60%",
    image: photo1,
    title: "TikTok непокорим?",
    description:
      "Даря так точно не считает. Еще пару месяцев и ваши рекомендации будут заполнены её работами.",
  },
  {
    label: "Дарей",
    x: "80%",
    y: "55%",
    image: photo1,
    title: "TikTok непокорим?",
    description:
      "Даря так точно не считает. Еще пару месяцев и ваши рекомендации будут заполнены её работами.",
  },
  {
    label: "Дарюшка",
    x: "70%",
    y: "70%",
    image: photo1,
    title: "TikTok непокорим?",
    description:
      "Даря так точно не считает. Еще пару месяцев и ваши рекомендации будут заполнены её работами.",
  },
  {
    label: "Дашка-Чебурашка",
    x: "25%",
    y: "75%",
    image: photo1,
    title: "TikTok непокорим?",
    description:
      "Даря так точно не считает. Еще пару месяцев и ваши рекомендации будут заполнены её работами.",
  },
  {
    label: "Дарюша",
    x: "10%",
    y: "87%",
    image: photo1,
    title: "TikTok непокорим?",
    description:
      "Даря так точно не считает. Еще пару месяцев и ваши рекомендации будут заполнены её работами.",
  },
  {
    label: "Доря",
    x: "55%",
    y: "90%",
    image: photo1,
    title: "TikTok непокорим?",
    description:
      "Даря так точно не считает. Еще пару месяцев и ваши рекомендации будут заполнены её работами.",
  },
];

export default birthdayItems;
